keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_regdef.h
/** \\brief  Channel Trigger Value Register */
typedef struct _Ifx_PSI5S_CTV_Bits
{
    unsigned int CTV:16;                    /**< \brief [15:0] Channel Trigger Value CTV (rw) */
    unsigned int CTC:16;                    /**< \brief [31:16] Channel Trigger Counter (rw) */
} Ifx_PSI5S_CTV_Bits;

/** \\brief  Frame Counter Register */
typedef struct _Ifx_PSI5S_FCNT_Bits
{
    unsigned int FC0:3;                     /**< \brief [2:0] Frame Counter for Channel x (r) */
    unsigned int FC1:3;                     /**< \brief [5:3] Frame Counter for Channel x (r) */
    unsigned int FC2:3;                     /**< \brief [8:6] Frame Counter for Channel x (r) */
    unsigned int FC3:3;                     /**< \brief [11:9] Frame Counter for Channel x (r) */
    unsigned int FC4:3;                     /**< \brief [14:12] Frame Counter for Channel x (r) */
    unsigned int FC5:3;                     /**< \brief [17:15] Frame Counter for Channel x (r) */
    unsigned int FC6:3;                     /**< \brief [20:18] Frame Counter for Channel x (r) */
    unsigned int FC7:3;                     /**< \brief [23:21] Frame Counter for Channel x (r) */
    unsigned int NFCLR0:1;                  /**< \brief [24:24] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR1:1;                  /**< \brief [25:25] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR2:1;                  /**< \brief [26:26] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR3:1;                  /**< \brief [27:27] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR4:1;                  /**< \brief [28:28] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR5:1;                  /**< \brief [29:29] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR6:1;                  /**< \brief [30:30] Clear Number of Frame Counter for Channel x (w) */
    unsigned int NFCLR7:1;                  /**< \brief [31:31] Clear Number of Frame Counter for Channel x (w) */
} Ifx_PSI5S_FCNT_Bits;

/** \\brief  Fractional Divider for Output CLK Register */
typedef struct _Ifx_PSI5S_FDO_Bits
{
    unsigned int STEP:11;                   /**< \brief [10:0] Step Value (rw) */
    unsigned int reserved_11:3;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_PSI5S_FDO_Bits;

/** \\brief  SMU Fractional Divider Register */
typedef struct _Ifx_PSI5S_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_PSI5S_FDR_Bits;

/** \\brief  Fractional Divider Register for Time Stamp */
typedef struct _Ifx_PSI5S_FDRT_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int ECS:3;                     /**< \brief [28:26] External Time Stamp Clear Source Select (rw) */
    unsigned int ECEA:1;                    /**< \brief [29:29] External Time Stamp Clear Enable A (rw) */
    unsigned int ECEB:1;                    /**< \brief [30:30] External Time Stamp Clear Enable B (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_PSI5S_FDRT_Bits;

/** \\brief  Fractional Divider Register */
typedef struct _Ifx_PSI5S_FDV_Bits
{
    unsigned int FD_VALUE:11;               /**< \brief [10:0] Fractional Divider Register Value (rw) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_PSI5S_FDV_Bits;

/** \\brief  Global Control Register */
typedef struct _Ifx_PSI5S_GCR_Bits
{
    unsigned int CRCI:1;                    /**< \brief [0:0] CRCI (rw) */
    unsigned int XCRCI:1;                   /**< \brief [1:1] XCRCI (rw) */
    unsigned int TEI:1;                     /**< \brief [2:2] TEI (rw) */
    unsigned int PE:1;                      /**< \brief [3:3] PE (rw) */
    unsigned int FE:1;                      /**< \brief [4:4] FE (rw) */
    unsigned int OE:1;                      /**< \brief [5:5] OE (rw) */
    unsigned int RBI:1;                     /**< \brief [6:6] RBI (rw) */
    unsigned int HDI:1;                     /**< \brief [7:7] HDI (rw) */
    unsigned int ETC0:1;                    /**< \brief [8:8] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC1:1;                    /**< \brief [9:9] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC2:1;                    /**< \brief [10:10] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC3:1;                    /**< \brief [11:11] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC4:1;                    /**< \brief [12:12] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int CEN0:1;                    /**< \brief [16:16] Enable Channel x (rw) */
    unsigned int CEN1:1;                    /**< \brief [17:17] Enable Channel x (rw) */
    unsigned int CEN2:1;                    /**< \brief [18:18] Enable Channel x (rw) */
    unsigned int CEN3:1;                    /**< \brief [19:19] Enable Channel x (rw) */
    unsigned int CEN4:1;                    /**< \brief [20:20] Enable Channel x (rw) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int IDT:4;                     /**< \brief [27:24] Idle Time (GLOBAL VALUE FOR ALL CHANNELS) (rw) */
    unsigned int reserved_28:3;             /**< \brief \internal Reserved */
    unsigned int ASC:1;                     /**< \brief [31:31] ASC only Mode (rw) */
} Ifx_PSI5S_GCR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_PSI5S_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_PSI5S_ID_Bits;

/** \\brief  Interrupt Node Pointer Register */
typedef struct _Ifx_PSI5S_INP_Bits
{
    unsigned int RSI:3;                     /**< \brief [2:0] Interrupt Node Pointer for Interrupt RSI (rw) */
    unsigned int RDI:3;                     /**< \brief [5:3] Interrupt Node Pointer for Interrupt RDI (rw) */
    unsigned int RBI:3;                     /**< \brief [8:6] Interrupt Node Pointer for Interrupt RBI (rw) */
    unsigned int TEI:3;                     /**< \brief [11:9] Interrupt Node Pointer for Interrupt TEI (rw) */
    unsigned int CHCI:3;                    /**< \brief [14:12] Interrupt Node Pointer for Interrupt CHCI (rw) */
    unsigned int CRCI:3;                    /**< \brief [17:15] Interrupt Node Pointer for Interrupt CRCI (rw) */
    unsigned int TPI:3;                     /**< \brief [20:18] Interrupt Node Pointer for Interrupt TOI (rw) */
    unsigned int TPOI:3;                    /**< \brief [23:21] Interrupt Node Pointer for TPOI (rw) */
    unsigned int HDI:3;                     /**< \brief [26:24] Interrupt Node Pointer for HDI (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INP_Bits;

/** \\brief  Interrupt Node Pointer G Register */
typedef struct _Ifx_PSI5S_INPG_Bits
{
    unsigned int TIR:3;                     /**< \brief [2:0] Interrupt Node Pointer for Interrupt TIR (rw) */
    unsigned int RIR:3;                     /**< \brief [5:3] Interrupt Node Pointer for Interrupt RIR (rw) */
    unsigned int EIR:3;                     /**< \brief [8:6] Interrupt Node Pointer for Interrupt EIR (rw) */
    unsigned int TBIR:3;                    /**< \brief [11:9] Interrupt Node Pointer for Interrupt TBIR (rw) */
    unsigned int XCRCI:3;                   /**< \brief [14:12] Interrupt Node Pointer for Interrupt XCRCI (rw) */
    unsigned int FOI:3;                     /**< \brief [17:15] Interrupt Node Pointer for Interrupt FOI (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_PSI5S_INPG_Bits;

/** \\brief  Interrupt Clear Register */
typedef struct _Ifx_PSI5S_INTCLR_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Clear Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Clear Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Clear Interrupt Request Flag TEI (w) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Clear Interrupt Request Flag CHCI (w) */
    unsigned int CRCI:1;                    /**< \brief [5:5] Clear Interrupt Request Flag CRCI (w) */
    unsigned int TPI:1;                     /**< \brief [6:6] Clear Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Clear Interrupt Request Flag TPOI (w) */
    unsigned int HDI:1;                     /**< \brief [8:8] Clear Interrupt Request Flag HDI (w) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTCLR_Bits;

/** \\brief  Interrupt Clear Register G */
typedef struct _Ifx_PSI5S_INTCLRG_Bits
{
    unsigned int TIR:1;                     /**< \brief [0:0] Clear Interrupt Request Flag TIR (w) */
    unsigned int RIR:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RIR (w) */
    unsigned int EIR:1;                     /**< \brief [2:2] Clear Interrupt Request Flag EIR (w) */
    unsigned int TBIR:1;                    /**< \brief [3:3] Clear Interrupt Request Flag TBIR (w) */
    unsigned int XCRCI:1;                   /**< \brief [4:4] Clear Interrupt Request Flag XCRCI (w) */
    unsigned int FOI:1;                     /**< \brief [5:5] Clear Interrupt Request Flag FOI (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTCLRG_Bits;

/** \\brief  Interrupt Enable Register */
typedef struct _Ifx_PSI5S_INTEN_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Enable Interrupt Request RSI (rw) */
    unsigned int RDI:1;                     /**< \brief [1:1] Enable Interrupt Request RDI (rw) */
    unsigned int RBI:1;                     /**< \brief [2:2] Enable Interrupt Request RBI (rw) */
    unsigned int TEI:1;                     /**< \brief [3:3] Enable Interrupt Request TEI (rw) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Enable Interrupt Request CHCI (rw) */
    unsigned int CRCI:1;                    /**< \brief [5:5] Enable Interrupt Request CRCI (rw) */
    unsigned int TPI:1;                     /**< \brief [6:6] Enable Interrupt Request TPI (rw) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Enable Interrupt Request TPOI (rw) */
    unsigned int HDI:1;                     /**< \brief [8:8] Enable Interrupt Request HDI (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTEN_Bits;

